tap "yt-dlp/taps"

# Bootstrap
brew "chezmoi"

# CLI tools
brew "ansible"
brew "ansible-lint"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "nmap"
brew "restic"
brew "rsync"
brew "tmux"
brew "uv"
brew "watch"
brew "yt-dlp"

# Languages / runtimes
brew "node"
brew "python@3.13"

# AI
brew "gemini-cli"

# Editors
brew "neovim"

# Apps
cask "alacritty"
cask "android-file-transfer"
cask "anki"
cask "appcleaner"
cask "balenaetcher"
cask "calibre"
cask "claude"
cask "db-browser-for-sqlite"
cask "discord"
cask "font-caskaydia-cove-nerd-font"
cask "font-monaspace"
cask "ghostty"
cask "google-drive"
cask "hyperkey"
cask "keka"
cask "musicbrainz-picard"
cask "obsidian"
cask "plex"
cask "rectangle"
cask "todoist-app"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "vlc"
cask "wox"

# VS Code extensions
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "drewxs.tokyo-night-dark"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
